Revit 2026 API

# ViewDuplicate Method

---

Duplicates this view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId Duplicate(
	ViewDuplicateOption duplicateOption
)
```
```vb
Public Function Duplicate (
	duplicateOption As ViewDuplicateOption
) As ElementId
```
```cpp
public:
ElementId^ Duplicate(
	ViewDuplicateOption duplicateOption
)
```
```fsharp
member Duplicate :
        duplicateOption : ViewDuplicateOption -> ElementId
```

#### Parameters

duplicateOption ViewDuplicateOption
     The option to use when duplicating the view.

#### Return Value

ElementId The id of the newly created view.

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | View cannot be duplicated |

#### Reference

View Class

Autodesk.Revit.DB Namespace